c_structures.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+KEYWORDS: C struct union typedef bit-field
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: структуры в C

** Структура
   Это совокупность нескольких переменных, часто различных типов, сгруппированных под единым именем для удобства обращения. Главное изменение, внесённое стандартом ANSI в работу со структурами, — это определение присваивания структур. Теперь структуры можно копировать, присваивать, передавать в функции и возвращать из функций.

   Ключевое слово *struct* начинает объявление структуры, состоящее из списка объявлений элементов в фигурных скобках. После слова *struct* может стоять необязательный идентификатор, именуемый /меткой структуры/. Метка обозначает конкретный структурный тип; впоследствии её можно использовать для краткости, опуская всё, что находится в скобках при объявлении структур того же типа.
   #+name: point
   #+BEGIN_SRC c :exports code
     struct point {
         int x;
         int y;
     };
   #+END_SRC

   Переменные, перечисленные в объявлении структуры, называются её /членами/, /элементами/ или /полями/. Элемент структуры или её метка может иметь то же имя, что и обыкновенная переменная безо всякого конфликта, поскольку они всегда отличаются по контексту.

   Объявление со словом *struct* фактически вводит новый тип данных. Поэтому допустимо такое объявление переменных:
   #+BEGIN_SRC c :exports code
     struct { int x; int y; } x, y z;
   #+END_SRC
   Данный код объявляет переменные $x, y, z$ определённого именованного типа и выделяет для них место в памяти. Объявление структуры, после которого нет списка переменных, не выделяет никакой памяти для объектов, а просто описывает форму структуры. Так же можно объявлять переменные, используя метку структуры:
   #+BEGIN_SRC c :exports code
     struct point pt;
   #+END_SRC

   Структуру можно инициализировать, поставив после её определения список значений-констант:
   #+BEGIN_SRC c :exports code
     struct point maxpt = { 320, 200 };
   #+END_SRC

   Обращение к элементам структуры выполняется следующим образом:
   #+BEGIN_SRC C :exports both :includes <stdio.h> <math.h> :results output :flags -lm :noweb strip-export
     <<point>>
     struct point pt = { 1, 2 };
     double dist = sqrt((double)pt.x * pt.x + (double)pt.y * pt.y);
     printf("distance from O(0, 0) to pt(%d, %d) is %f", pt.x, pt.y, dist);
   #+END_SRC

   #+RESULTS:
   : distance from O(0, 0) to pt(1, 2) is 2.236068

   Структуры можно вкладывать друг в друга:
   #+name: rect
   #+BEGIN_SRC C :exports none :noweb strip-export
     struct rect {
         struct point pt1;
         struct point pt2;
     };
   #+END_SRC
   #+BEGIN_SRC C :exports both :results output :noweb yes
     <<point>>
     <<rect>>

     struct rect screen = {{0, 0}, {10, 10}};
     printf("rectangle with diagonal points: (%d, %d), (%d, %d)",
            screen.pt1.x, screen.pt1.y,
            screen.pt2.x, screen.pt2.y);
   #+END_SRC

   #+RESULTS:
   : rectangle with diagonal points: (0, 0), (10, 10)

*** Структуры и функции
    Расширенными операциями над структурами являются копирование или присваивание структуры как целого, взятие её адреса операцией *&*, а так же обращение к её элементам. Копирование и присваивание включают также в себя передачу аргументов в функции и возвращение значений из функций. *Структуры нельзя сравнивать между собой.* Структуру можно инициализировать списком констант-инициализаторов для всех её полей.
    #+BEGIN_SRC C :exports both :main no :results output :noweb strip-export
      <<point>>
      <<rect>>

      struct point makepoint (int x, int y) {
          return (struct point){x,y};
      }

      int main(void) {
          struct rect screen;
          struct point middle;
          screen.pt1 = makepoint(0, 0);
          screen.pt2 = makepoint(1000, 1000);
          middle = makepoint((screen.pt1.x + screen.pt2.x) / 2,
                             (screen.pt1.y + screen.pt2.y) / 2);
          printf("middle point is (%d, %d)", middle.x, middle.y);
          return 0;
      }
    #+END_SRC

    #+RESULTS:
    : middle point is (500, 500)

    #+BEGIN_SRC C :noweb strip-export :results output :exports code :main no
      <<point>>

      struct point addpoint(struct point p1, struct point p2) {
          p1.x += p2.x;
          p1.y += p2.y;
          return p1;
      }
    #+END_SRC
    Вместо того чтобы помещать результат во временную переменную, мы инкрементировали компоненты структуры p1, чтобы подчеркнуть тот факт, что параметры-структуры передаются по значениям, как и любые другие параметры.

    Если в функцию необходимо передать большую структуру, это лучше сделать передав указатель на неё, а не копию всех её данных. Указатели на структуры обладают всеми свойстваи указателей на обычные переменные.
    #+BEGIN_SRC C :exports both :results output :noweb strip-export
      <<point>>

      struct point origin = {1, 2}, *pp = &origin;
      printf("origin is (%d, %d)\n", (*pp).x, (*pp).y);
    #+END_SRC

    #+RESULTS:
    : origin is (1, 2)

    Указатели на структуры используются так часто, что для удобства записи ссылок по ним введено дополнительное обозначение: /p->элемент-структуры/
    #+BEGIN_SRC C :exports both :results output :noweb strip-export
      <<point>>

      struct point origin = {1, 2}, *pp = &origin;
      printf("origin is (%d, %d)", pp->x, pp->y);
    #+END_SRC

    #+RESULTS:
    : origin is (1, 2)

