c_structures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-25 Wed 17:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>структуры в C</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="content">
<h1 class="title">структуры в C</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f66544">1. Структура</a>
<ul>
<li><a href="#org9bce37d">1.1. Структуры и функции</a></li>
</ul>
</li>
<li><a href="#org5d7d4ba">2. Массивы структур</a></li>
<li><a href="#org6844630">3. typedef</a></li>
<li><a href="#orge1a0b03">4. Объединения</a></li>
<li><a href="#orgb5af3be">5. Битовые поля</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9f66544" class="outline-2">
<h2 id="org9f66544"><span class="section-number-2">1</span> Структура</h2>
<div class="outline-text-2" id="text-1">
<p>
Это совокупность нескольких переменных, часто различных типов, сгруппированных под единым именем для удобства обращения. Главное изменение, внесённое стандартом ANSI в работу со структурами, — это определение присваивания структур. Теперь структуры можно копировать, присваивать, передавать в функции и возвращать из функций.
</p>

<p>
Ключевое слово <b>struct</b> начинает объявление структуры, состоящее из списка объявлений элементов в фигурных скобках. После слова <b>struct</b> может стоять необязательный идентификатор, именуемый <i>меткой структуры</i>. Метка обозначает конкретный структурный тип; впоследствии её можно использовать для краткости, опуская всё, что находится в скобках при объявлении структур того же типа.
</p>
<div class="org-src-container">
<pre class="src src-c" id="orgc7fcde1"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">x</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">y</span>;
};
</pre>
</div>

<p>
Переменные, перечисленные в объявлении структуры, называются её <i>членами</i>, <i>элементами</i> или <i>полями</i>. Элемент структуры или её метка может иметь то же имя, что и обыкновенная переменная безо всякого конфликта, поскольку они всегда отличаются по контексту.
</p>

<p>
Объявление со словом <b>struct</b> фактически вводит новый тип данных. Поэтому допустимо такое объявление переменных:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> { <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">x</span>; <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">y</span>; } <span style="color: #ffffff;">x</span>, <span style="color: #ffffff;">y</span> z;
</pre>
</div>
<p>
Данный код объявляет переменные \(x, y, z\) определённого именованного типа и выделяет для них место в памяти. Объявление структуры, после которого нет списка переменных, не выделяет никакой памяти для объектов, а просто описывает форму структуры. Так же можно объявлять переменные, используя метку структуры:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt</span>;
</pre>
</div>

<p>
Структуру можно инициализировать, поставив после её определения список значений-констант:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">maxpt</span> = { 320, 200 };
</pre>
</div>

<p>
Обращение к элементам структуры выполняется следующим образом:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt</span> = { 1, 2 };
<span style="color: #00ffff;">double</span> <span style="color: #ffffff;">dist</span> = sqrt((<span style="color: #00ffff;">double</span>)pt.x * pt.x + (<span style="color: #00ffff;">double</span>)pt.y * pt.y);
printf(<span style="color: #ffa500;">"distance from O(0, 0) to pt(%d, %d) is %f"</span>, pt.x, pt.y, dist);
</pre>
</div>

<p>
Структуры можно вкладывать друг в друга:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">x</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">y</span>;
};
<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">rect</span> {
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt1</span>;
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt2</span>;
};

<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">rect</span> <span style="color: #ffffff;">screen</span> = {{0, 0}, {10, 10}};
printf(<span style="color: #ffa500;">"rectangle with diagonal points: (%d, %d), (%d, %d)"</span>,
       screen.pt1.x, screen.pt1.y,
       screen.pt2.x, screen.pt2.y);
</pre>
</div>

<pre class="example">
rectangle with diagonal points: (0, 0), (10, 10)

</pre>
</div>

<div id="outline-container-org9bce37d" class="outline-3">
<h3 id="org9bce37d"><span class="section-number-3">1.1</span> Структуры и функции</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Расширенными операциями над структурами являются копирование или присваивание структуры как целого, взятие её адреса операцией <b>&amp;</b>, а так же обращение к её элементам. Копирование и присваивание включают также в себя передачу аргументов в функции и возвращение значений из функций. <b>Структуры нельзя сравнивать между собой.</b> Структуру можно инициализировать списком констант-инициализаторов для всех её полей.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #00ffff; font-weight: bold;">makepoint</span> (<span style="color: #00ffff;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">y</span>) {
    <span style="color: #00ff00; font-weight: bold;">return</span> (<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span>){x,y};
}

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>(<span style="color: #00ffff;">void</span>) {
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">rect</span> <span style="color: #ffffff;">screen</span>;
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">middle</span>;
    screen.pt1 = makepoint(0, 0);
    screen.pt2 = makepoint(1000, 1000);
    middle = makepoint((screen.pt1.x + screen.pt2.x) / 2,
                       (screen.pt1.y + screen.pt2.y) / 2);
    printf(<span style="color: #ffa500;">"middle point is (%d, %d)"</span>, middle.x, middle.y);
    <span style="color: #00ff00; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
middle point is (500, 500)

</pre>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #00ffff; font-weight: bold;">addpoint</span>(<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">p1</span>, <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">p2</span>) {
    p1.x += p2.x;
    p1.y += p2.y;
    <span style="color: #00ff00; font-weight: bold;">return</span> p1;
}
</pre>
</div>
<p>
Вместо того чтобы помещать результат во временную переменную, мы инкрементировали компоненты структуры p1, чтобы подчеркнуть тот факт, что параметры-структуры передаются по значениям, как и любые другие параметры.
</p>

<p>
Если в функцию необходимо передать большую структуру, это лучше сделать передав указатель на неё, а не копию всех её данных. Указатели на структуры обладают всеми свойстваи указателей на обычные переменные.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">origin</span> = {1, 2}, *<span style="color: #ffffff;">pp</span> = &amp;origin;
printf(<span style="color: #ffa500;">"origin is (%d, %d)\n"</span>, (*pp).x, (*pp).y);
</pre>
</div>

<pre class="example">
origin is (1, 2)

</pre>

<p>
Указатели на структуры используются так часто, что для удобства записи ссылок по ним введено дополнительное обозначение: <i>p-&gt;элемент-структуры</i>
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">origin</span> = {1, 2}, *<span style="color: #ffffff;">pp</span> = &amp;origin;
printf(<span style="color: #ffa500;">"origin is (%d, %d)"</span>, pp-&gt;x, pp-&gt;y);
</pre>
</div>

<pre class="example">
origin is (1, 2)

</pre>
</div>
</div>
</div>
