c_structures.org
** Массивы структур
   #+BEGIN_SRC C :results output :export both :main no :cmdline <<< '#include <stdio.h> int main (void) { int res = 0; puts("Hello World"); return res; }'
     #include <stdio.h>
     #include <ctype.h>
     #include <string.h>

     #define MAXWORD 100
     #define BUFSIZE 100

     struct key {
         char *word;
         int count;
     } keytab[] = {
         "auto", 0, "break", 0, "case", 0, "char", 0, "const", 0, "continue", 0, "default", 0,
         "do", 0, "double", 0, "else", 0, "enum", 0, "extern", 0, "float", 0, "for", 0,
         "goto", 0, "if", 0, "int", 0, "long", 0, "register", 0, "return", 0, "short", 0,
         "signed", 0, "sizeof", 0, "static", 0, "struct", 0, "switch", 0, "typedef", 0,
         "union", 0, "unsigned", 0, "void", 0, "volatile", 0, "while", 0
     };

     #define NKEYS (sizeof keytab / sizeof keytab[0])

     char buf[BUFSIZE];
     int bufp = 0;

     int getword(char *, int);
     int binsearch(char *, struct key *, int);
     int getch(void);
     void ungetch(int c);

     int main(void) {
         int n;
         char word[MAXWORD];
         while (getword(word, MAXWORD) != EOF) {
             if (isalpha(word[0]))
                 if ((n = binsearch(word, keytab, NKEYS)) >= 0)
                     keytab[n].count++;
         }
         for (n = 0; n < NKEYS; n++) {
             if (keytab[n].count > 0)
                 printf("%4d %s\n", keytab[n].count, keytab[n].word);
         }
         return 0;
     }

     int binsearch(char *word, struct key *tab, int n) {
         int cond;
         int low, high, mid;

         low = 0;
         high = n - 1;
         while (low <= high) {
             mid = (low+high) / 2;
             if ((cond = strcmp(word, tab[mid].word)) < 0)
                 high = mid - 1;
             else if (cond > 0)
                 low = mid + 1;
             else
                 return mid;
         }
         return -1;
     }

     int getword(char *word, int lim) {
         int c;
         char *w = word;
         while (isspace(c = getch()))
             ;
         if (c != EOF)
             ,*w++ = c;
         if (!(isalpha(c) || c == '_')) {
             ,*w = '\0';
             return c;
         }
         for (;--lim>0;w++) {
             if (!isalnum(*w = getch())) {
                 ungetch(*w);
                 break;
             }
         }
         ,*w = '\0';
         return word[0];
     }

     int getch(void) {
         return (bufp > 0) ? buf[--bufp] : getchar();
     }

     void ungetch(int c) {
         if (bufp >= BUFSIZE) printf("ungetch too many characters\n");
         else buf[bufp++] = c;
     }
   #+END_SRC

   #+RESULTS:
   : 2 int
   : 1 return
   : 1 void

** typedef
   Имя нового типа, объявляемое в *typedef*, стоит не сразу после ключевого слова, а на месте имени переменной. Синтаксически ключевое слово *typedef* можно считать аналогом идентификатора класса памяти: *extern*, *static* и т.п. Новые типы, определяемые с помощью *typedef*, начинаются с прописной буквы, чтобы можно было их легко различить.
   #+BEGIN_SRC c :exports code :main no
     typedef struct tnode *Treeptr;

     typedef struct tnode {
         char *word;
         int count;
         struct tnode *left;
         struct tnode *right;
     } Trenode;

     Treeptr talloc(void) {
         return (Treeptr)malloc(sizeof(Treenode));
     }
   #+END_SRC
   Фактически, оператор *typedef* очень напоминает директиву *#define* с тем исключением, что, поскольку он анализируется компилятором, он может допускать такие текстовые подстановки, которые препроцессору не по силам. Например:
   #+BEGIN_SRC c :exports code :main no
     typedef int (*PFI)(char*, char*);
   #+END_SRC
   Здесь опеределяется тип /PFI/ — "указатель на функцию от двух аргументов типа char*, возвращающую int". Этот тип можно использовать, например, таким образом:
   #+BEGIN_SRC c :exports code :main no
     PFI strcmp, numcmp;
   #+END_SRC

