c_structures.html

<div id="outline-container-org5d7d4ba" class="outline-2">
<h2 id="org5d7d4ba"><span class="section-number-2">2</span> Массивы структур</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;stdio.h&gt;</span>
<span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;ctype.h&gt;</span>
<span style="color: #8090A2;">#include</span> <span style="color: #ffa500;">&lt;string.h&gt;</span>

<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">MAXWORD</span> 100
<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">BUFSIZE</span> 100

<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">key</span> {
    <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">word</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">count</span>;
} <span style="color: #ffffff;">keytab</span>[] = {
    <span style="color: #ffa500;">"auto"</span>, 0, <span style="color: #ffa500;">"break"</span>, 0, <span style="color: #ffa500;">"case"</span>, 0, <span style="color: #ffa500;">"char"</span>, 0, <span style="color: #ffa500;">"const"</span>, 0, <span style="color: #ffa500;">"continue"</span>, 0, <span style="color: #ffa500;">"def</span><span style="color: #DC8CC3; background-color: #3F3F3F;">ault"</span><span style="color: #DC8CC3; background-color: #3F3F3F;">, 0,</span>
    <span style="color: #ffa500;">"do"</span>, 0, <span style="color: #ffa500;">"double"</span>, 0, <span style="color: #ffa500;">"else"</span>, 0, <span style="color: #ffa500;">"enum"</span>, 0, <span style="color: #ffa500;">"extern"</span>, 0, <span style="color: #ffa500;">"float"</span>, 0, <span style="color: #ffa500;">"for"</span>, <span style="color: #DC8CC3; background-color: #3F3F3F;">0,</span>
    <span style="color: #ffa500;">"goto"</span>, 0, <span style="color: #ffa500;">"if"</span>, 0, <span style="color: #ffa500;">"int"</span>, 0, <span style="color: #ffa500;">"long"</span>, 0, <span style="color: #ffa500;">"register"</span>, 0, <span style="color: #ffa500;">"return"</span>, 0, <span style="color: #ffa500;">"short"</span><span style="color: #DC8CC3; background-color: #3F3F3F;">, 0,</span>
    <span style="color: #ffa500;">"signed"</span>, 0, <span style="color: #ffa500;">"sizeof"</span>, 0, <span style="color: #ffa500;">"static"</span>, 0, <span style="color: #ffa500;">"struct"</span>, 0, <span style="color: #ffa500;">"switch"</span>, 0, <span style="color: #ffa500;">"typedef"</span>, <span style="color: #DC8CC3; background-color: #3F3F3F;">0,</span>
    <span style="color: #ffa500;">"union"</span>, 0, <span style="color: #ffa500;">"unsigned"</span>, 0, <span style="color: #ffa500;">"void"</span>, 0, <span style="color: #ffa500;">"volatile"</span>, 0, <span style="color: #ffa500;">"while"</span>, 0
};

<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">NKEYS</span> (<span style="color: #00ff00; font-weight: bold;">sizeof</span> keytab / <span style="color: #00ff00; font-weight: bold;">sizeof</span> keytab[0])

<span style="color: #00ffff;">char</span> <span style="color: #ffffff;">buf</span>[BUFSIZE];
<span style="color: #00ffff;">int</span> <span style="color: #ffffff;">bufp</span> = 0;

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">getword</span>(<span style="color: #00ffff;">char</span> *, <span style="color: #00ffff;">int</span>);
<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">binsearch</span>(<span style="color: #00ffff;">char</span> *, <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">key</span> *, <span style="color: #00ffff;">int</span>);
<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">getch</span>(<span style="color: #00ffff;">void</span>);
<span style="color: #00ffff;">void</span> <span style="color: #00ffff; font-weight: bold;">ungetch</span>(<span style="color: #00ffff;">int</span> <span style="color: #ffffff;">c</span>);

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">main</span>(<span style="color: #00ffff;">void</span>) {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">n</span>;
    <span style="color: #00ffff;">char</span> <span style="color: #ffffff;">word</span>[MAXWORD];
    <span style="color: #00ff00; font-weight: bold;">while</span> (getword(word, MAXWORD) != EOF) {
        <span style="color: #00ff00; font-weight: bold;">if</span> (isalpha(word[0]))
            <span style="color: #00ff00; font-weight: bold;">if</span> ((n = binsearch(word, keytab, NKEYS)) &gt;= 0)
                keytab[n].count++;
    }
    <span style="color: #00ff00; font-weight: bold;">for</span> (n = 0; n &lt; NKEYS; n++) {
        <span style="color: #00ff00; font-weight: bold;">if</span> (keytab[n].count &gt; 0)
            printf(<span style="color: #ffa500;">"%4d %s\n"</span>, keytab[n].count, keytab[n].word);
    }
    <span style="color: #00ff00; font-weight: bold;">return</span> 0;
}

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">binsearch</span>(<span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">word</span>, <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">key</span> *<span style="color: #ffffff;">tab</span>, <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">n</span>) {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">cond</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">low</span>, <span style="color: #ffffff;">high</span>, <span style="color: #ffffff;">mid</span>;

    low = 0;
    high = n - 1;
    <span style="color: #00ff00; font-weight: bold;">while</span> (low &lt;= high) {
        mid = (low+high) / 2;
        <span style="color: #00ff00; font-weight: bold;">if</span> ((cond = strcmp(word, tab[mid].word)) &lt; 0)
            high = mid - 1;
        <span style="color: #00ff00; font-weight: bold;">else</span> <span style="color: #00ff00; font-weight: bold;">if</span> (cond &gt; 0)
            low = mid + 1;
        <span style="color: #00ff00; font-weight: bold;">else</span>
            <span style="color: #00ff00; font-weight: bold;">return</span> mid;
    }
    <span style="color: #00ff00; font-weight: bold;">return</span> -1;
}

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">getword</span>(<span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">word</span>, <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">lim</span>) {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">c</span>;
    <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">w</span> = word;
    <span style="color: #00ff00; font-weight: bold;">while</span> (isspace(c = getch()))
        ;
    <span style="color: #00ff00; font-weight: bold;">if</span> (c != EOF)
        *w++ = c;
    <span style="color: #00ff00; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>(isalpha(c) || c == <span style="color: #ffa500;">'_'</span>)) {
        *w = <span style="color: #ffa500;">'\0'</span>;
        <span style="color: #00ff00; font-weight: bold;">return</span> c;
    }
    <span style="color: #00ff00; font-weight: bold;">for</span> (;--lim&gt;0;w++) {
        <span style="color: #00ff00; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>isalnum(*w = getch())) {
            ungetch(*w);
            <span style="color: #00ff00; font-weight: bold;">break</span>;
        }
    }
    *w = <span style="color: #ffa500;">'\0'</span>;
    <span style="color: #00ff00; font-weight: bold;">return</span> word[0];
}

<span style="color: #00ffff;">int</span> <span style="color: #00ffff; font-weight: bold;">getch</span>(<span style="color: #00ffff;">void</span>) {
    <span style="color: #00ff00; font-weight: bold;">return</span> (bufp &gt; 0) ? buf[--bufp] : getchar();
}

<span style="color: #00ffff;">void</span> <span style="color: #00ffff; font-weight: bold;">ungetch</span>(<span style="color: #00ffff;">int</span> <span style="color: #ffffff;">c</span>) {
    <span style="color: #00ff00; font-weight: bold;">if</span> (bufp &gt;= BUFSIZE) printf(<span style="color: #ffa500;">"ungetch too many characters\n"</span>);
    <span style="color: #00ff00; font-weight: bold;">else</span> buf[bufp++] = c;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6844630" class="outline-2">
<h2 id="org6844630"><span class="section-number-2">3</span> typedef</h2>
<div class="outline-text-2" id="text-3">
<p>
Имя нового типа, объявляемое в <b>typedef</b>, стоит не сразу после ключевого слова, а на месте имени переменной. Синтаксически ключевое слово <b>typedef</b> можно считать аналогом идентификатора класса памяти: <b>extern</b>, <b>static</b> и т.п. Новые типы, определяемые с помощью <b>typedef</b>, начинаются с прописной буквы, чтобы можно было их легко различить.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">typedef</span> <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">tnode</span> *<span style="color: #00ffff;">Treeptr</span>;

<span style="color: #00ff00; font-weight: bold;">typedef</span> <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">tnode</span> {
    <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">word</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">count</span>;
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">tnode</span> *<span style="color: #ffffff;">left</span>;
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">tnode</span> *<span style="color: #ffffff;">right</span>;
} <span style="color: #00ffff;">Trenode</span>;

<span style="color: #00ffff;">Treeptr</span> <span style="color: #00ffff; font-weight: bold;">talloc</span>(<span style="color: #00ffff;">void</span>) {
    <span style="color: #00ff00; font-weight: bold;">return</span> (<span style="color: #00ffff;">Treeptr</span>)malloc(<span style="color: #00ff00; font-weight: bold;">sizeof</span>(Treenode));
}
</pre>
</div>
<p>
Фактически, оператор <b>typedef</b> очень напоминает директиву <b>#define</b> с тем исключением, что, поскольку он анализируется компилятором, он может допускать такие текстовые подстановки, которые препроцессору не по силам. Например:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">typedef</span> <span style="color: #00ffff;">int</span> (*<span style="color: #00ffff;">PFI</span>)(<span style="color: #00ffff;">char</span>*, <span style="color: #00ffff;">char</span>*);
</pre>
</div>
<p>
Здесь опеределяется тип <i>PFI</i> — "указатель на функцию от двух аргументов типа char*, возвращающую int". Этот тип можно использовать, например, таким образом:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ffff;">PFI</span> <span style="color: #ffffff;">strcmp</span>, <span style="color: #ffffff;">numcmp</span>;
</pre>
</div>
</div>
</div>
