c_structures.org
** Объединения
   Это переменная, которая может содержать объекты различных типов и размеров (но не одновременно); при этом удовлетворение требований к размеру и выравниванию возлагается на компилятор. С помощью объединений можно работать с данными различных типов в пределах одного участка памяти, не привнося в программу элементы низкоуровневого, машинно-зависимого программирования.
   #+BEGIN_SRC c :exports code :main no
     union u_tag {
         int ival;
         float fval;
         char *sval;
     } u;
   #+END_SRC
   Переменная *u* будет иметь достаточную длину, чтобы содержать данные самого длинного из трёх типов; конкретный размер зависит от системы и реализации. Переменной *u* можно присваивать данные любого типа, а затем использовать их в выражениях (строго по правилам работы с конкретным типом). Извлекать можно данные только того типа, который был помещён при последнем обращении к переменной. Следить и помнить, какие именно данные были помещены в объединение, — это забота программиста; если поместить значение одного типа, а извлечь его как значение другого, результат будет системно-зависимым и трудно предсказуемым.

   Обращение к элементам объединения выполняется так же, как к элементам структуры:
   #+BEGIN_QUOTE
   имя-объединения.элемент
   указатель-на-объединение->элемент
   #+END_QUOTE
   Пусть в переменной $utype$ хранится информация о типе данных, находящихся в текущий момент в объединении:
   #+BEGIN_SRC c :exports code :main no
     if (utype == INT)
         printf("%d\n", u.ival);
     else if (utype == FLOAT)
         printf("%f\n", u.fval);
     else if (utype == STRING)
         printf("%s\n", u.sval);
     else
         printf("bad type %d in utype\n", utype);
   #+END_SRC

   Объединения могут применяться в структурах и массивах, и наоборот. Способ обращения к члену объединения в структуре (или к члену структуры в объединении) полностью идентичен обращению к элементу вложенной структуры.
   #+BEGIN_SRC C :exports both :results output
     #define INT 0
     #define FLOAT 1
     #define STRING 2

     struct {
         char *name;
         int flags;
         int utype;
         union {
             int ival;
             float fval;
             char *sval;
         } u;
     } symtab[] = {
         "test", 4, STRING, "data"
     };

     printf("symtab[%s]: %s", symtab[0].name, symtab[0].u.sval);
   #+END_SRC

   #+RESULTS:
   : symtab[test]: data

   Фактически, объединение является структурой, в которой все элементы имеют нулевое смещение от её начала, сама она имеет достаточную длину, чтобы в неё поместился самый длинный элемент, и при этом выравнивание происходит правильно для всех типов данных в объединении. Над объединениями разрешено выполнять те же операции, что и над структурами: присваивать или копировать как единое целое, брать адрес и обращаться к отдельным элементам.
   #+BEGIN_SRC C :exports both :results output :noweb strip-export
     <<point>>
     <<rect>>

     union {
         struct point pt;
         struct rect r;
     } g;

     struct point pt1 = {1, 2};
     struct rect r1 = { {1, 2}, {10, 11} };
     g.pt = pt1;
     printf("g: %d, %d\n", g.pt.x, g.pt.y);

     g.r = r1;
     printf("g: (%d, %d), (%d, %d)", g.r.pt1.x, g.r.pt1.y, g.r.pt2.x, g.r.pt2.y);
   #+END_SRC

   #+RESULTS:
   : g: 1, 2
   : g: (1, 2), (10, 11)

** Битовые поля
   Внутри системно-зависимой единицы памяти, которую мы будем называть "/словом/", можно задать /битовое поле/ (/bit-field/) — совокупность идущих подряд битов. Синтаксис определения и использования полей основан на структурах.
   #+BEGIN_SRC c :exports code :main no
     struct {
         unsigned int is_keyword :1;
         unsigned int is_extern  :1;
         unsigned int is_static  :1;
     } flags;
   #+END_SRC
   Данный код является заменой коду на константах:
   #+BEGIN_SRC c :exports code :main no
     #define KEYWORD  01
     #define EXTERNAL 02
     #define STATIC   04

     enum { KEYWORD = 01, EXTERNAL = 02, STATIC = 04 };
   #+END_SRC
   В переменной *flags* содержится три однобитных поля. Число после двоеточия задаёт ширину поля в битах. Поля объявлены как *unsigned int*, чтобы гарантированно быть велечинами без знака. Практически всё, что связано с битовыми полями, является системно-зависимым. Например, только в конкретной реализации определяется, могут ли поля перекрывать границы слов. Поля не обязаны иметь имена; безымянные поля (двоеточия с размером после них) часто используются для пропуска и резервирования отдельных битов. Для принудительного выравнивания по границе следующего слова можно использовать специальное значение длины поля, равное $0$. Совокупность полей — не массив, и у них нет адресов, поэтому операция & к ним неприменима.
