c_structures.html

<div id="outline-container-orge1a0b03" class="outline-2">
<h2 id="orge1a0b03"><span class="section-number-2">4</span> Объединения</h2>
<div class="outline-text-2" id="text-4">
<p>
Это переменная, которая может содержать объекты различных типов и размеров (но не одновременно); при этом удовлетворение требований к размеру и выравниванию возлагается на компилятор. С помощью объединений можно работать с данными различных типов в пределах одного участка памяти, не привнося в программу элементы низкоуровневого, машинно-зависимого программирования.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">union</span> <span style="color: #00ffff;">u_tag</span> {
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">ival</span>;
    <span style="color: #00ffff;">float</span> <span style="color: #ffffff;">fval</span>;
    <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">sval</span>;
} <span style="color: #ffffff;">u</span>;
</pre>
</div>
<p>
Переменная <b>u</b> будет иметь достаточную длину, чтобы содержать данные самого длинного из трёх типов; конкретный размер зависит от системы и реализации. Переменной <b>u</b> можно присваивать данные любого типа, а затем использовать их в выражениях (строго по правилам работы с конкретным типом). Извлекать можно данные только того типа, который был помещён при последнем обращении к переменной. Следить и помнить, какие именно данные были помещены в объединение, — это забота программиста; если поместить значение одного типа, а извлечь его как значение другого, результат будет системно-зависимым и трудно предсказуемым.
</p>

<p>
Обращение к элементам объединения выполняется так же, как к элементам структуры:
</p>
<blockquote>
<p>
имя-объединения.элемент
указатель-на-объединение-&gt;элемент
</p>
</blockquote>
<p>
Пусть в переменной \(utype\) хранится информация о типе данных, находящихся в текущий момент в объединении:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">if</span> (utype == INT)
    printf(<span style="color: #ffa500;">"%d\n"</span>, u.ival);
<span style="color: #00ff00; font-weight: bold;">else</span> <span style="color: #00ff00; font-weight: bold;">if</span> (utype == FLOAT)
    printf(<span style="color: #ffa500;">"%f\n"</span>, u.fval);
<span style="color: #00ff00; font-weight: bold;">else</span> <span style="color: #00ff00; font-weight: bold;">if</span> (utype == STRING)
    printf(<span style="color: #ffa500;">"%s\n"</span>, u.sval);
<span style="color: #00ff00; font-weight: bold;">else</span>
    printf(<span style="color: #ffa500;">"bad type %d in utype\n"</span>, utype);
</pre>
</div>

<p>
Объединения могут применяться в структурах и массивах, и наоборот. Способ обращения к члену объединения в структуре (или к члену структуры в объединении) полностью идентичен обращению к элементу вложенной структуры.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">INT</span> 0
<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">FLOAT</span> 1
<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">STRING</span> 2

<span style="color: #00ff00; font-weight: bold;">struct</span> {
    <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">name</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">flags</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">utype</span>;
    <span style="color: #00ff00; font-weight: bold;">union</span> {
        <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">ival</span>;
        <span style="color: #00ffff;">float</span> <span style="color: #ffffff;">fval</span>;
        <span style="color: #00ffff;">char</span> *<span style="color: #ffffff;">sval</span>;
    } <span style="color: #ffffff;">u</span>;
} <span style="color: #ffffff;">symtab</span>[] = {
    <span style="color: #ffa500;">"test"</span>, 4, STRING, <span style="color: #ffa500;">"data"</span>
};

printf(<span style="color: #ffa500;">"symtab[%s]: %s"</span>, symtab[0].name, symtab[0].u.sval);
</pre>
</div>

<pre class="example">
symtab[test]: data

</pre>

<p>
Фактически, объединение является структурой, в которой все элементы имеют нулевое смещение от её начала, сама она имеет достаточную длину, чтобы в неё поместился самый длинный элемент, и при этом выравнивание происходит правильно для всех типов данных в объединении. Над объединениями разрешено выполнять те же операции, что и над структурами: присваивать или копировать как единое целое, брать адрес и обращаться к отдельным элементам.
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #00ff00; font-weight: bold;">union</span> {
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt</span>;
    <span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">rect</span> <span style="color: #ffffff;">r</span>;
} <span style="color: #ffffff;">g</span>;

<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">point</span> <span style="color: #ffffff;">pt1</span> = {1, 2};
<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">rect</span> <span style="color: #ffffff;">r1</span> = { {1, 2}, {10, 11} };
g.pt = pt1;
printf(<span style="color: #ffa500;">"g: %d, %d\n"</span>, g.pt.x, g.pt.y);

g.r = r1;
printf(<span style="color: #ffa500;">"g: (%d, %d), (%d, %d)"</span>, g.r.pt1.x, g.r.pt1.y, g.r.pt2.x, g.r.pt2.y);
</pre>
</div>

<pre class="example">
g: 1, 2
g: (1, 2), (10, 11)

</pre>
</div>
</div>

<div id="outline-container-orgb5af3be" class="outline-2">
<h2 id="orgb5af3be"><span class="section-number-2">5</span> Битовые поля</h2>
<div class="outline-text-2" id="text-5">
<p>
Внутри системно-зависимой единицы памяти, которую мы будем называть "<i>словом</i>", можно задать <i>битовое поле</i> (<i>bit-field</i>) — совокупность идущих подряд битов. Синтаксис определения и использования полей основан на структурах.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #00ff00; font-weight: bold;">struct</span> {
    <span style="color: #00ffff;">unsigned</span> <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">is_keyword</span> :1;
    <span style="color: #00ffff;">unsigned</span> <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">is_extern</span>  :1;
    <span style="color: #00ffff;">unsigned</span> <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">is_static</span>  :1;
} <span style="color: #ffffff;">flags</span>;
</pre>
</div>
<p>
Данный код является заменой коду на константах:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">KEYWORD</span>  01
<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">EXTERNAL</span> 02
<span style="color: #8090A2;">#define</span> <span style="color: #ffffff;">STATIC</span>   04

<span style="color: #00ff00; font-weight: bold;">enum</span> { <span style="color: #ffffff;">KEYWORD</span> = 01, <span style="color: #ffffff;">EXTERNAL</span> = 02, <span style="color: #ffffff;">STATIC</span> = 04 };
</pre>
</div>
<p>
В переменной <b>flags</b> содержится три однобитных поля. Число после двоеточия задаёт ширину поля в битах. Поля объявлены как <b>unsigned int</b>, чтобы гарантированно быть велечинами без знака. Практически всё, что связано с битовыми полями, является системно-зависимым. Например, только в конкретной реализации определяется, могут ли поля перекрывать границы слов. Поля не обязаны иметь имена; безымянные поля (двоеточия с размером после них) часто используются для пропуска и резервирования отдельных битов. Для принудительного выравнивания по границе следующего слова можно использовать специальное значение длины поля, равное \(0\). Совокупность полей — не массив, и у них нет адресов, поэтому операция &amp; к ним неприменима.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-25 Wed 17:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
